Program n_28;
 var a:string;
begin
 writeln ('Введите символ элемента');
 readln (a);
 if a='H' then 
 writeln ('H: название - водород;относительная атомная масса - 1;порядковый номер - 1;период - 1;группа - I(A).');
 if a='He' then
 writeln ('He: название - гелий;относительная атомная масса - 4;порядковый номер - 2;период - 1;группа - VIII(A).');
 if a='Li' then 
 writeln ('Li: название - литий;относительная атомная масса - 6,939;порядковый номер - 3;период - 2;группа - I(A).');
 if a='Be' then 
 writeln ('Be: название - берилий;относительная атомная масса - 9,122;порядковый номер - 4;период - 2;группа - II(A).');
 if a='B' then 
 writeln ('B: название - бор;относительная атомная масса - 10,811;порядковый номер - 5;период - 2;группа - III(A).');
 if a='C' then 
 writeln ('С: название - углерод;относительная атомная масса - 12,01115;порядковый номер - 6;период - 2;группа - IV(A).');
 if a='N' then 
 writeln ('N: название - азот;относительная атомная масса - 14,0067;порядковый номер - 7;период - 2;группа - V(A).');
 if a='O' then 
 writeln ('O: название - кислород;относительная атомная масса - 16,994;порядковый номер - 8;период - 2;группа - VI(A).');
 if a='F' then 
 writeln ('F: название - фтор;относительная атомная масса - 18,9984;порядковый номер - 9;период - 2;группа - VII(A).');
 if a='Ne' then 
 writeln ('Ne: название - неон;относительная атомная масса - 20,179;порядковый номер - 10;период - 2;группа -  VIII(A).');
 if a='Na' then 
 writeln ('Na: название - натрий;относительная атомная масса - 22,9898;порядковый номер - 11;период - 3;группа - I(A).');
 if a='Mg' then 
 writeln ('Mg: название - магний;относительная атомная масса - 24,305;порядковый номер - 12;период - 3;группа - II(A).');
 if a='Al' then 
 writeln ('Al: название - алюминий;относительная атомная масса - 26,9815;порядковый номер - 13;период - 3;группа - III(A).');
 if a='Si' then 
 writeln ('Si: название - кремний;относительная атомная масса - 28,086;порядковый номер - 14;период - 3;группа - IV(A).');
 if a='P' then 
 writeln ('P: название - фосфор;относительная атомная масса - 30,9738;порядковый номер - 15;период - 3;группа - V(A).');
 if a='S' then 
 writeln ('S: название - сера;относительная атомная масса - 32.064;порядковый номер - 16;период - 3;группа - VI(A).');
 if a='Cl' then 
 writeln ('Cl: название - хлор;относительная атомная масса - 35,453;порядковый номер - 17;период - 3;группа - VII(A).');
 if a='Ar' then 
 writeln ('Ar: название - аргон;относительная атомная масса - 39,948;порядковый номер - 18;период - 3;группа - VIII(A).');
 if a='K' then
 writeln ('K: название - калий;относительная атомная масса - 39,102;порядковый номер - 19;период - 4;группа - I(A).');
 if a='Ca' then
 writeln ('Ca: название - кальций;относительная атомная масса - 40.08;порядковый номер - 20;период - 4;группа - II(A).');
 if a='Sc' then
 writeln ('Sc: название - скандий;относительная атомная масса - 44,956;порядковый номер - 21;период - 4;группа - III(B).');
 if a='Ti' then
 writeln ('Ti: название - титан;относительная атомная масса - 47,9;порядковый номер - 22;период - 4;группа - IV(B).');
 if a='V' then
 writeln ('V: название - ванадий;относительная атомная масса - 50,942;порядковый номер - 23;период - 4;группа - V(B).');
 if a='Cr' then
 writeln ('Cr: название - хром;относительная атомная масса - 51,996;порядковый номер - 24;период - 4;группа - VI(B).');
 if a='Mn' then
 writeln ('Mn: название - марганец;относительная атомная масса - 54,938;порядковый номер - 25;период - 4;группа - VII(B).');
 if a='Fe' then
 writeln ('Fe: название - железо;относительная атомная масса - 55,847;порядковый номер - 26;период - 4;группа - VIII(B).');
 if a='Co' then
 writeln ('Co: название - кобальт;относительная атомная масса - 58,933;порядковый номер - 27;период - 4;группа - VIII(B).');
 if a='Ni' then
 writeln ('Ni: название - никель;относительная атомная масса - 58,71;порядковый номер - 28;период - 4;группа - VIII(B).');
 if a='Cu' then
 writeln ('Cu: название - медь;относительная атомная масса - 63,546;порядковый номер - 29;период - 4;группа - I(B).');
 if a='Zn' then
 writeln ('Zn: название - цинк;относительная атомная масса - 65,37;порядковый номер - 30;период - 4;группа - II(B).');
 if a='Ga' then
 writeln ('Ga: название - галий;относительная атомная масса - 69,72;порядковый номер - 31;период - 4;группа - III(A).');
 if a='Ge' then
 writeln ('Ge: название - германий;относительная атомная масса - 72,59;порядковый номер - 32;период - 4;группа - IV(A).');
 if a='As' then
 writeln ('As: название - мышьяк;относительная атомная масса - 74,9216;порядковый номер - 33;период - 4;группа - V(A).');
 if a='Se' then
 writeln ('Se: название - селен;относительная атомная масса - 78,96;порядковый номер - 34;период - 4;группа - VI(A).');
 if a='Br' then
 writeln ('Br: название - бром;относительная атомная масса - 79.904;порядковый номер - 35;период - 4;группа - VII(A).');
 if a='Kr' then
 writeln ('Kr: название - криптон;относительная атомная масса - 83,8;порядковый номер - 36;период - 4;группа - VIII(A).');
end.